---
kind: other
id: Properties.T:Autodesk.Revit.DB.CurveLoopsProfile
source: html/80d8586b-f6f5-5b97-42b5-bc50bae1a68c.htm
---
# CurveLoopsProfile Properties

Identifies if the object is read-only or modifiable.